"use strict"

var myasnikova32 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 9:00 - 18:00<br><b>пт:</b> 9:00 - 17:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
                   '<b><span style="color: red">Касса:</span><br>пн.-чт.:</b> 9:00 - 18:00<br><b>пт.:</b> 9:00 - 17:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
    moskovskaya13 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 9:00 - 17:30<br><b>пт:</b> 9:00 - 16:15<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
                    '<b><span style="color: red">Касса:</span><br>пн.-чт.:</b> 9:00 - 17:30<br><b>пт:</b> 9:00 - 16:15<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
    zaslavskaya10 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 9:00 - 19:00<br><b>пт:</b> 9:00 - 18:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
                    '<b><span style="color: red">Касса:</span><br>пн.-чт.:</b> 9:00 - 19:00<br><b>пт:</b> 9:00 - 18:00<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>';
