






google.maps.event.addDomListener(window, 'load', init);
function init() {

        var myOptions = {
            center: new google.maps.LatLng(53.910715, 27.539682), // Координаты, какое место отображать на карте
            zoom: 11, // Уровень риближения карты
            mapTypeId: google.maps.MapTypeId.ROADMAP // Тип карты

        };
        var map = new google.maps.Map(document.getElementById("map"), // В каком блоке будет отображаться карта
            myOptions);

            setMarkers(map, locations);
    };

      var
                          pritickogo93 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:30 - 19:30<br><b>сб:</b>' +
          ' 11:00 - 19:00<br><b>вых.:</b>вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          pritickogo23a = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 9:00 - 19:00<br><b>вых.:</b>' +
          ' сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          pobediteley100 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 9:00-17:00<br><b>пт.:</b>' +
          ' 9:00-16:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          kylman3 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 10:00-18:00<br><b>пт:</b>' +
          ' 10:00-17:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-чт.:</b> 10:00-18:00<br><b>обед:</b> 14:30-15:15 <b>' +
          'тех. пер.:</b> 12:10-12:20, 16:50-17:00, <br><b>пт:</b> 10:00-17:00<br><b>обед:</b> 14:30-15:15 <b>' +
          'тех. пер.:</b> 12:10-12:20,<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          tolbyhina2 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 10:00-18:00<br><b>пт:</b> 10:00-17:00<br>' +
          '<b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>';
          asanalieva23 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 09:00-17:00<br><b>пт:</b> 09:00-16:00<br>' +
          '<b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-чт.:</b> 09:00-17:00<br><b>обед:</b>' +
          ' (вт., ср., чт.): 14.00 – 14.45 с 20 по 25 число каждого месяца без тех. перерывов и обеда <br><b>пт:</b> 09:00-16:00<br><b>вых.:</b>' +
          ' сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>';
          yakybova10 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b>' +
          ' сокращён на 1 час<br><b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>обед:</b> 14.15–14.45 <b>' +
          'тех. пер.:</b> 12:00-12:15, 16:40-16:50<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          dzerzhinskogo91 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:30-19:00<br><b>вых.:</b>' +
          ' сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 10:30-19:00<br><b>обед:</b> 14:15-15:00 <b>тех. пер.:</b>' +
          ' 12:00-12:15,17:00-17:15<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          babyshkina39 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 08:30-17:00<br><b>пт.:</b> 8:30-15:45<br>' +
          '<b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-чт.:</b> 08:30-17:00<br><b>обед:</b> 13:00-13:45<br><b>пт.:</b>' +
          ' 08.30-15.45<br><b>обед:</b> 13:00-13:45<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          partizanskiy150a = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:00-19:00<br><b>сб.:</b> 10:00-16:00<br><b>обед:</b>' +
          ' 13:00-13:30<br><b>вых.:</b> вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          velikigostinec143b = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-17:00<br><b>вых.:</b>' +
          ' сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          gagarina46a = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:30-17:30<br><b>вых.:</b> сб., вс., праздн. д.<br>' +
          '<b>предпраздн. дни:</b> сокращён на 1 час<br><b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 09:30-17:30<br><b>вых.:</b>' +
          ' сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          lenina20 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>обед:</b>' +
          ' 14:00-15:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>обед: </b>14:00-15:00<b> тех. пер.:</b>' +
          ' 11:45-12:00, 16:45-17:00<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          lenina212 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:30-17:30<br><b>обед:</b> 13:00-14:00<br>' +
          '<b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br><b><span style="color: red">' +
          'КАСС НЕТ</span></b></p>',
          lenina42 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-19:00<br><b>вых.:</b>' +
          ' сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br><b><span style="color: red">Касса:</span>' +
          '<br>пн.-пт.:</b> 09:00-19:00<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          sovetskaya82 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-18:30<br><b>вых.:</b> сб., вс., праздн. д.<br>' +
          '<b>предпраздн. дни:</b> сокращён на 1 час<br><b><span style="color: red">КАСС НЕТ</span></b></p>',
          dzerzhinskogo61 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 08:30-18:00<br><b>пт.: </b>8:30-17:00<br>' +
          '<b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br><b>' +
          '<span style="color: red">Касса:</span><br>пн.-чт.:</b> 08:30-18:00<br><b>пт.: </b>8:30-17:00<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          pervomayskaya40 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-17:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b>' +
          ' сокращён на 1 час<br><b><span style="color: red">КАСС НЕТ</span></b></p>',
          kirova637 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-19:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 11:00-19:00<br><b>обед: </b>15:00-16:00<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          skorini23 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>обед:</b> 13:30-14:15<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b>' +
          ' сокращён на 1 час<br><b><span style="color: red">КАСС НЕТ</span></b></p>',
          molodezhnaya10397 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>обед:</b> 14:00-15:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b>' +
          ' сокращён на 1 час<br><b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 10:00-18:00<br><b>тех. пер.: </b>11:45-12:00, 16.15-16.30<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          mira411 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-18:00<br><b>сб.:</b> 09:00-16:00<br><b>вых.:</b>вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          sovetskaya71 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-19:00<br><b>вых.:</b> сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Касса:</span><br>пн.-пт.:</b> 09:00-19:00<br><b>тех. пер.: </b>11:45-12:00, 15:30-15:45<br><b>вых.:</b> сб., вс., праздн. д. <br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          saeta4 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 10:00-17:30<br><b>Обед:</b> 14:00-15:00<br><b>вых.:</b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          sovetskaya93 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-17:30<br><b>вых.:</b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          pervomayskaya52 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-18:00<br><b>вых.:</b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          kaluchinskaya21 = '<p><b><span style="color: red">Розница:</span><br>пн.-чт.:</b> 09:00-19:00<br><b>пт.:</b> 09:00-18:00<br><b>сб.: </b>9:30-15:00 <b>обед: </b> 11:30-12:00<b><br>вых.:</b>' +
          ' вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br><b><span style="color: red">Кассы:</span><br>пн.-чт.:</b> 09:00-19:00 <b>обед: </b>14:15-15:00<br><b>пт.: </b>' +
          '9:00-18:00 <b>обед: </b>14:15-15:00<br><b>вых.: </b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          volodarskogo59a = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-18:00<br><b>сб.: </b>9:00-15:00 <br><b>вых.: </b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b>' +
          ' сокращён на 1 час<br><b><span style="color: red">КАСС НЕТ</span></b></p>',
          kirova8 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-18:30<br><b>вых.: </b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>',
          dzerzhinskogo7a = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-18:30<br><b>вых.: </b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">Кассы: </span><br>пн.-пт.:</b> 09:00-18:30<br><b>вых.: </b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час</p>',
          socialisticheskaya12353 = '<p><b><span style="color: red">Розница:</span><br>пн.-пт.:</b> 09:00-17:00<br><b>вых.: </b>сб., вс., праздн. д.<br><b>предпраздн. дни:</b> сокращён на 1 час<br>' +
          '<b><span style="color: red">КАСС НЕТ</span></b></p>';

      var locations = [
          ['Заславская 10', 53.910715, 27.539682, zaslavskaya10],
          ['Московская 13', 53.887498, 27.538790, moskovskaya13],
          ['Мясникова 32', 53.898431, 27.543401, myasnikova32],
          ['Притыцкого 93', 53.905752, 27.439478, pritickogo93],
          ['Притыцкого 23а', 53.908726, 27.492640, pritickogo23a],
          ['Победителей 100', 53.938192, 27.481544, pobediteley100],
          ['Кульман 3', 53.919941, 27.582657, kylman3],
          ['Толбухина 2',53.926155, 27.614699, tolbyhina2],
          ['Асаналиева 2-3', 53.843072, 27.538444, asanalieva23],
          ['Якубова 10', 53.851319, 27.597962, yakybova10],
          ['Дзержинского 91', 53.859541, 27.482222, dzerzhinskogo91],
          ['Бабушкина 39', 53.801015, 27.593587, babyshkina39],
          ['Партизанский 150а', 53.859956, 27.673831, partizanskiy150a],
          ['Великий Гостинец', 54.299183, 26.864108, velikigostinec143b],
          ['Гагарина 46а', 54.220744, 28.490420, gagarina46a],
          ['Железнодорожная 21а', 52.792377, 27.540362, lenina20],
          ['Ленина 22', 54.097924, 28.306040, lenina212],
          ['Ленина 42', 52.091464, 23.687066, lenina42],
          ['Советская 82', 53.131890, 26.015455, sovetskaya82],
          ['Дзержинского 61', 52.201317, 24.342713, dzerzhinskogo61],
          ['Кирова 6-37', 55.194533, 30.191387, kirova637],
          ['Франциска Скорины 23', 55.484580, 28.781697, skorini23],
          ['Молодёжная 103-97', 55.530739, 28.664094, molodezhnaya10397],
          ['Мира 4-11', 54.511077, 30.427815, mira411],
          ['Советская 71', 52.443821, 31.001379, sovetskaya71],
          ['Саета 4', 52.049719, 29.262541, saeta4],
          ['Советская 93', 52.366400, 30.401991, sovetskaya93],
          ['Первомайская 52', 52.893247, 30.039648, pervomayskaya52],
          ['Калючинская 21', 53.679390, 23.830906, kaluchinskaya21],
          ['Володарского 59а', 54.615056, 25.970784, volodarskogo59a],
          ['Кирова 8', 53.893564, 25.299661, kirova8],
          ['Дзержинского 7а', 53.905232, 30.335142, dzerzhinskogo7a],
          ['Социалистическая 123-53', 53.143305, 29.227559, socialisticheskaya12353]
      ];
      function setMarkers(map, locations) {

              var marker, i, mark_position;
              for (i = 0; i < locations.length; i++) { // Проходимся по нашему массиву с марками

      			// Тут вроде и так все понятно
                  var title = locations[i][0];
                  var lat = locations[i][1];
                  var long = locations[i][2];
                  var text = locations[i][3];

                  mark_position = new google.maps.LatLng(lat, long); // Создаем позицию для отметки

                   marker = new google.maps.Marker({ // Что будет содержаться в отметке
                       map: map, // К какой карте относиться отметка
                       title: title, // Заголовок отметки
                       position: mark_position, // Позиция отметки
                       animation: google.maps.Animation.DROP, // Анимация
                       icon: 'img/office-marker.png' // Можно поменять иконку, если оставить пустые скобки, то будет оригинальная иконка
                  });

      			// Дальше создаем контент для каждой отметки

                  var content = '<div>' + '<h1>' + title + '</h1>' + text + '</div>';
                  var infowindow = new google.maps.InfoWindow();

      			// При нажатии на марку, будет отображаться контент

                  google.maps.event.addListener(marker,'click', (function(marker,content,infowindow){
                      return function() {
                          infowindow.setContent(content);
                          infowindow.open(map,marker);
                      };
                  })(marker,content,infowindow));
              };
          };
